Repository: youtonghy/Todex_mobile
Catalog: Todex/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko

source: 切换到此后端并打开工作区
en: Switch to this backend and open the workspace
ja: このバックエンドに切り替えてワークスペースを開く
ko: 이 백엔드로 전환하고 워크스페이스 열기

source: 切换到计划模式；后接内容时直接发送
en: Switch to plan mode; sends directly when followed by text
ja: 計画モードに切り替えます。後に内容を続けるとそのまま送信します
ko: 계획 모드로 전환합니다. 뒤에 내용을 입력하면 바로 전송합니다

source: 切换工作树
en: Switch worktree
ja: ワークツリーを切り替え
ko: 워크트리 전환

source: 切换操作台侧栏
en: Toggle workbench sidebar
ja: ワークベンチのサイドバーを切り替え
ko: 워크벤치 사이드바 전환

source: 切换权限模式
en: Switch permission mode
ja: 権限モードを切り替え
ko: 권한 모드 전환

source: 切换模型；不带参数时打开模型搜索
en: Switch model; opens model search when used without arguments
ja: モデルを切り替えます。引数なしの場合はモデル検索を開きます
ko: 모델을 전환합니다. 인수가 없으면 모델 검색을 엽니다

source: 创建 PR
en: Create PR
ja: PR を作成
ko: PR 생성

source: 创建 PR…
en: Create PR…
ja: PR を作成…
ko: PR 생성…

source: 创建分支
en: Create branch
ja: ブランチを作成
ko: 브랜치 생성

source: 创建分支…
en: Create branch…
ja: ブランチを作成…
ko: 브랜치 생성…

source: 创建分支（不自动切换）
en: Create branch (without switching)
ja: ブランチを作成（自動で切り替えない）
ko: 브랜치 생성(자동 전환 안 함)

source: 创建工作树
en: Create worktree
ja: ワークツリーを作成
ko: 워크트리 생성

source: 创建工作树…
en: Create worktree…
ja: ワークツリーを作成…
ko: 워크트리 생성…

source: 创建草稿 PR
en: Create draft PR
ja: ドラフト PR を作成
ko: 드래프트 PR 생성

source: 初始化仓库
en: Initialize repository
ja: リポジトリを初期化
ko: 리포지토리 초기화

source: 删除
en: Delete
ja: 削除
ko: 삭제

source: 删除任务
en: Delete task
ja: タスクを削除
ko: 작업 삭제

source: 删除供应商“%@”？
en: Delete provider "%@"?
ja: プロバイダー「%@」を削除しますか？
ko: 프로바이더 "%@"을(를) 삭제하시겠습니까?

source: 删除后端？
en: Delete backend?
ja: バックエンドを削除しますか？
ko: 백엔드를 삭제하시겠습니까?

source: 删除此后端
en: Delete this backend
ja: このバックエンドを削除
ko: 이 백엔드 삭제

source: 删除：%@
en: Delete: %@
ja: 削除：%@
ko: 삭제: %@

source: 刷新
en: Refresh
ja: 更新
ko: 새로고침

source: 刷新工具
en: Refresh tools
ja: ツールを更新
ko: 도구 새로고침

source: 刷新工具会由 Backend 连接此 MCP；调用结果在详情页显示。
en: Refreshing tools makes the backend connect to this MCP; call results appear on the details page.
ja: ツールを更新すると、バックエンドがこの MCP に接続します。呼び出し結果は詳細ページに表示されます。
ko: 도구를 새로고침하면 백엔드가 이 MCP에 연결합니다. 호출 결과는 상세 페이지에 표시됩니다.

source: 刷新状态
en: Refresh status
ja: 状態を更新
ko: 상태 새로고침

source: 剪贴板中没有配对文本
en: No pairing text on the clipboard
ja: クリップボードにペアリングテキストがありません
ko: 클립보드에 페어링 텍스트가 없습니다

source: 加入队列
en: Add to queue
ja: キューに追加
ko: 큐에 추가

source: 加密公钥
en: Encryption public key
ja: 暗号化公開鍵
ko: 암호화 공개 키

source: 加载更早的消息
en: Load earlier messages
ja: 以前のメッセージを読み込む
ko: 이전 메시지 불러오기

source: 加载更早的记录失败，点按重试
en: Failed to load earlier history. Tap to retry
ja: 以前の履歴を読み込めませんでした。タップして再試行
ko: 이전 기록을 불러오지 못했습니다. 탭하여 다시 시도

source: 加载过程记录失败，点按重试
en: Failed to load activity log. Tap to retry
ja: 作業過程の読み込みに失敗しました。タップして再試行
ko: 작업 과정을 불러오지 못했습니다. 탭하여 다시 시도

source: 升级 %@？
en: Upgrade %@?
ja: %@ をアップグレードしますか？
ko: %@을(를) 업그레이드하시겠습니까?

source: 升级到最新版
en: Upgrade to latest
ja: 最新版にアップグレード
ko: 최신 버전으로 업그레이드

source: 升级失败
en: Upgrade failed
ja: アップグレードに失敗しました
ko: 업그레이드 실패

source: 升级成功
en: Upgrade succeeded
ja: アップグレードに成功しました
ko: 업그레이드 성공

source: 升级操作
en: Upgrade actions
ja: アップグレード操作
ko: 업그레이드 작업

source: 升级进行中
en: Upgrade in progress
ja: アップグレード中
ko: 업그레이드 진행 중

source: 历史事件属于其他对话
en: History events belong to another conversation
ja: 履歴イベントが別の会話のものです
ko: 기록 이벤트가 다른 대화에 속합니다

source: 历史分页响应无效
en: Invalid history page response
ja: 履歴ページの応答が無効です
ko: 기록 페이지 응답이 잘못되었습니다

source: 历史分页过多，恢复未完成
en: Too many history pages; restore incomplete
ja: 履歴ページが多すぎるため、復元が完了しませんでした
ko: 기록 페이지가 너무 많아 복원이 완료되지 않았습니다

source: 历史记录存在缺口，请重新核对
en: History has gaps; please review again
ja: 履歴に欠落があります。もう一度確認してください
ko: 기록에 누락이 있습니다. 다시 확인하세요

source: 压缩
en: Compact
ja: 圧縮
ko: 압축

source: 压缩上下文
en: Compact context
ja: コンテキストを圧縮
ko: 컨텍스트 압축

source: 压缩上下文，保留关键进展
en: Compact the context, keeping key progress
ja: 主要な進捗を残してコンテキストを圧縮
ko: 주요 진행 상황을 유지하며 컨텍스트 압축

source: 原因
en: Reason
ja: 理由
ko: 이유

source: 原对话已有新内容，已保留原对话。
en: The original conversation has new content, so it was kept.
ja: 元の会話に新しい内容があるため、元の会話を残しました。
ko: 원래 대화에 새 내용이 있어 원래 대화를 유지했습니다.

source: 参数
en: Arguments
ja: 引数
ko: 인수

source: 参数 JSON
en: Arguments JSON
ja: 引数 JSON
ko: 인수 JSON

source: 参数 JSON 不能超过 1 MiB
en: Arguments JSON can't exceed 1 MiB
ja: 引数 JSON は 1 MiB 以下にしてください
ko: 인수 JSON은 1 MiB를 초과할 수 없습니다

source: 参数 Schema
en: Arguments schema
ja: 引数スキーマ
ko: 인수 스키마

source: 参数说明
en: Argument descriptions
ja: 引数の説明
ko: 인수 설명

source: 发送
en: Send
ja: 送信
ko: 전송

source: 发送此委托？
en: Send this delegation?
ja: この委任を送信しますか？
ko: 이 위임을 보내시겠습니까?

source: 发送给 Agent 执行
en: Send to Agent to run
ja: エージェントに送信して実行
ko: 에이전트에게 보내 실행

source: 取消
en: Cancel
ja: キャンセル
ko: 취소

source: 取消关联
en: Unlink
ja: 関連付けを解除
ko: 연결 해제

source: 取消置顶
en: Unpin
ja: ピン留めを解除
ko: 고정 해제

source: 取消自动合并
en: Disable auto-merge
ja: 自動マージをキャンセル
ko: 자동 머지 취소

source: 取消请求
en: Cancel request
ja: リクエストをキャンセル
ko: 요청 취소

source: 取消验证
en: Cancel verification
ja: 認証をキャンセル
ko: 인증 취소

source: 变更文件%@
en: Changed files%@
ja: 変更ファイル%@
ko: 변경된 파일%@

source: 另有 %lld 项审批
en: %lld more approvals
ja: ほかに %lld 件の承認
ko: 승인 %lld개 더 있음

source: 可升级
en: Update available
ja: アップグレード可能
ko: 업그레이드 가능

source: 可合并：%@ · %@
en: Mergeable: %@ · %@
ja: マージ可能：%@ · %@
ko: 머지 가능: %@ · %@

source: 可用
en: Available
ja: 利用可能
ko: 사용 가능

source: 可选，写入 [models].default，如 grok-build
en: Optional; written to [models].default, e.g. grok-build
ja: 任意。[models].default に書き込まれます（例: grok-build）
ko: 선택 사항이며 [models].default에 기록됩니다 (예: grok-build)

source: 右移
en: Move right
ja: 右へ移動
ko: 오른쪽으로 이동

source: 合并 PR #%lld
en: Merge PR #%lld
ja: PR #%lld をマージ
ko: PR #%lld 머지

source: 合并 PR…
en: Merge PR…
ja: PR をマージ…
ko: PR 머지…

source: 合并结果尚未保存；保存时仍会校验远端版本。
en: The merge result isn't saved yet; the remote version will still be checked on save.
ja: マージ結果はまだ保存されていません。保存時にリモートのバージョンを検証します。
ko: 병합 결과가 아직 저장되지 않았습니다. 저장할 때 원격 버전을 다시 확인합니다.

source: 同一工作区共享
en: Shared per workspace
ja: ワークスペースごとに共有
ko: 워크스페이스별 공유

source: 同一工作区共享终端、浏览器和文件标签
en: Share terminal, browser, and file tabs within a workspace
ja: 同じワークスペースでターミナル・ブラウザ・ファイルタブを共有
ko: 같은 워크스페이스에서 터미널, 브라우저, 파일 탭 공유

source: 同步
en: Sync
ja: 同期
ko: 동기화

source: 同步对话记录
en: Sync conversation history
ja: 会話履歴を同期
ko: 대화 기록 동기화

source: 同步并核对
en: Sync and verify
ja: 同期して確認
ko: 동기화 및 확인

source: 同步记录
en: Sync history
ja: 履歴を同期
ko: 기록 동기화

source: 名称
en: Name
ja: 名前
ko: 이름

source: 名称与供应商 ID 必填
en: Name and provider ID are required
ja: 名前とプロバイダー ID は必須です
ko: 이름과 프로바이더 ID는 필수입니다

source: 名称（如 fix-login）
en: Name (e.g. fix-login)
ja: 名前（例：fix-login）
ko: 이름(예: fix-login)

source: 后台对话状态同步已暂停：%@
en: Background conversation sync paused: %@
ja: バックグラウンドの会話状態の同期を一時停止しました：%@
ko: 백그라운드 대화 상태 동기화가 일시 중지됨: %@

source: 后端
en: Backend
ja: バックエンド
ko: 백엔드

source: 后端 %@ 与本应用 %@ 版本不一致，请升级以避免不兼容。
en: Backend version %@ does not match app version %@. Upgrade to avoid incompatibility.
ja: バックエンド %@ とこのアプリ %@ のバージョンが一致しません。非互換を避けるためにアップグレードしてください。
ko: 백엔드 %@ 버전과 앱 %@ 버전이 일치하지 않습니다. 호환성 문제를 피하려면 업그레이드하세요.

source: 后端 terminal.input 仅支持 UTF-8 文本；此输入未发送。
en: The backend terminal.input only supports UTF-8 text; this input was not sent.
ja: バックエンドの terminal.input は UTF-8 テキストのみ対応しています。この入力は送信されませんでした。
ko: 백엔드 terminal.input은 UTF-8 텍스트만 지원합니다. 이 입력은 전송되지 않았습니다.

source: 后端不存在运行中的此 PTY · 可启动新进程
en: This PTY is not running on the backend · You can start a new process
ja: この PTY はバックエンドで実行されていません · 新しいプロセスを起動できます
ko: 백엔드에서 이 PTY가 실행 중이 아닙니다 · 새 프로세스를 시작할 수 있습니다

source: 后端原生队列
en: Backend native queue
ja: バックエンドのネイティブキュー
ko: 백엔드 네이티브 큐

source: 后端原生队列…
en: Backend native queue…
ja: バックエンドのネイティブキュー…
ko: 백엔드 네이티브 큐…

source: 后端响应缺少 %@ 数组，请检查后端版本
en: Backend response is missing the %@ array; check the backend version
ja: バックエンドの応答に %@ 配列がありません。バックエンドのバージョンを確認してください
ko: 백엔드 응답에 %@ 배열이 없습니다. 백엔드 버전을 확인하세요

source: 后端地址
en: Backend address
ja: バックエンドのアドレス
ko: 백엔드 주소

source: 后端工作目录
en: Backend working directory
ja: バックエンドの作業ディレクトリ
ko: 백엔드 작업 디렉터리

source: 后端已切换，此审批已失效。
en: The backend changed; this approval is no longer valid.
ja: バックエンドが切り替わったため、この承認は無効になりました。
ko: 백엔드가 전환되어 이 승인은 더 이상 유효하지 않습니다.

source: 后端已拒绝申请，请核对后重新申请。
en: The backend rejected the request. Check and request again.
ja: バックエンドが申請を拒否しました。確認してから再度申請してください。
ko: 백엔드가 신청을 거부했습니다. 확인 후 다시 신청하세요.

source: 后端已确认 %@
en: Backend confirmed %@
ja: バックエンドが %@ を確認しました
ko: 백엔드가 %@ 확인함

source: 后端未允许升级此 CLI
en: The backend does not allow upgrading this CLI
ja: バックエンドはこの CLI のアップグレードを許可していません
ko: 백엔드가 이 CLI 업그레이드를 허용하지 않습니다

source: 后端未接受此工作区路径（可能不在允许的工作区根目录内）
en: The backend did not accept this workspace path (it may be outside the allowed workspace roots)
ja: バックエンドがこのワークスペースのパスを受け付けませんでした（許可されたワークスペースのルート外の可能性があります）
ko: 백엔드가 이 워크스페이스 경로를 허용하지 않았습니다(허용된 워크스페이스 루트 밖에 있을 수 있음)

source: 后端未提供 diff 字段；该 Legacy capability 不可用
en: The backend did not provide a diff field; this Legacy capability is unavailable
ja: バックエンドが diff フィールドを提供していません。この Legacy capability は利用できません
ko: 백엔드가 diff 필드를 제공하지 않았습니다. 이 Legacy capability는 사용할 수 없습니다

source: 后端未确认订阅
en: The backend did not confirm the subscription
ja: バックエンドがサブスクリプションを確認しませんでした
ko: 백엔드가 구독을 확인하지 않았습니다

source: 后端未返回 CLI
en: The backend returned no CLI
ja: バックエンドが CLI を返しませんでした
ko: 백엔드가 CLI를 반환하지 않았습니다

source: 后端未返回 Skill 正文
en: The backend did not return the Skill body
ja: バックエンドが Skill の本文を返しませんでした
ko: 백엔드가 Skill 본문을 반환하지 않았습니다

source: 后端未返回供应商数据
en: The backend did not return provider data
ja: バックエンドがプロバイダーデータを返しませんでした
ko: 백엔드가 프로바이더 데이터를 반환하지 않았습니다

source: 后端未连接，Git 状态暂不可用
en: Backend not connected; Git status is unavailable
ja: バックエンドが未接続のため、Git の状態は利用できません
ko: 백엔드가 연결되지 않아 Git 상태를 사용할 수 없습니다

source: 后端标识重复
en: Duplicate backend ID
ja: バックエンド ID が重複しています
ko: 백엔드 ID가 중복됩니다

source: 后端没有提供可用操作。请关闭此页并核对会话记录。
en: The backend provided no available actions. Close this page and check the conversation history.
ja: バックエンドが利用可能な操作を提供していません。このページを閉じて会話履歴を確認してください。
ko: 백엔드가 사용 가능한 작업을 제공하지 않았습니다. 이 페이지를 닫고 대화 기록을 확인하세요.

source: 后端没有确认文件保存
en: The backend did not confirm the file was saved
ja: バックエンドがファイルの保存を確認しませんでした
ko: 백엔드가 파일 저장을 확인하지 않았습니다

source: 后端返回了无效的 CLI 升级状态；请刷新核对
en: The backend returned an invalid CLI upgrade status; refresh to verify
ja: バックエンドが無効な CLI アップグレード状態を返しました。更新して確認してください
ko: 백엔드가 유효하지 않은 CLI 업그레이드 상태를 반환했습니다. 새로고침하여 확인하세요

source: 后端返回的升级操作标识不匹配
en: The upgrade operation ID returned by the backend does not match
ja: バックエンドが返したアップグレード操作 ID が一致しません
ko: 백엔드가 반환한 업그레이드 작업 ID가 일치하지 않습니다

source: 后端返回空 diff。
en: The backend returned an empty diff.
ja: バックエンドが空の diff を返しました。
ko: 백엔드가 빈 diff를 반환했습니다.

source: 后端连接
en: Backend connection
ja: バックエンド接続
ko: 백엔드 연결

source: 后端配置已改变，请重新打开配对页面
en: The backend configuration changed; reopen the pairing page
ja: バックエンドの設定が変更されました。ペアリング画面を開き直してください
ko: 백엔드 설정이 변경되었습니다. 페어링 페이지를 다시 여세요

source: 后续任务可获得当前 Agent 支持的最高权限。 %@
en: Subsequent tasks can get the highest permissions the current Agent supports. %@
ja: 以降のタスクは、現在のエージェントがサポートする最高の権限を取得できます。 %@
ko: 이후 작업은 현재 에이전트가 지원하는 최고 권한을 얻을 수 있습니다. %@

source: 否
en: No
ja: いいえ
ko: 아니요

source: 启动
en: Start
ja: 起動
ko: 시작

source: 启动 PTY 中…
en: Starting PTY…
ja: PTY を起動中…
ko: PTY 시작 중…

source: 启动结果需核对；不会自动重试创建 PTY。
en: The start result needs verification; PTY creation will not be retried automatically.
ja: 起動結果の確認が必要です。PTY の作成は自動で再試行されません。
ko: 시작 결과를 확인해야 합니다. PTY 생성은 자동으로 재시도되지 않습니다.

source: 启用
en: Enable
ja: 有効にする
ko: 활성화

source: 启用完全访问？
en: Enable full access?
ja: フルアクセスを有効にしますか？
ko: 전체 액세스를 활성화하시겠습니까?

source: 启用的思考强度
en: Enabled thinking levels
ja: 有効な思考レベル
ko: 활성화된 추론 수준

source: 启用自动合并
en: Enable auto-merge
ja: 自動マージを有効化
ko: 자동 머지 활성화

source: 启用自动合并…
en: Enable auto-merge…
ja: 自動マージを有効化…
ko: 자동 머지 활성화…

source: 启用页面脚本
en: Enable page scripts
ja: ページスクリプトを有効化
ko: 페이지 스크립트 활성화

source: 启用页面脚本？
en: Enable page scripts?
ja: ページスクリプトを有効にしますか？
ko: 페이지 스크립트를 활성화하시겠습니까?

source: 命令
en: Commands
ja: コマンド
ko: 명령

source: 命令缺少后端提供的 invocation，无法插入
en: The command is missing the backend-provided invocation and cannot be inserted
ja: コマンドにバックエンド提供の invocation がないため、挿入できません
ko: 명령에 백엔드가 제공한 invocation이 없어 삽입할 수 없습니다

source: 回到最新消息
en: Jump to latest message
ja: 最新のメッセージに戻る
ko: 최신 메시지로 이동

source: 回答
en: Answer
ko: 답변

source: 回答已提交，正在等待会话记录更新。
en: Answer submitted; waiting for the conversation history to update.
ja: 回答を送信しました。会話履歴の更新を待っています。
ko: 답변을 제출했습니다. 대화 기록 업데이트를 기다리는 중입니다.

source: 图片
en: Image
ja: 画像
ko: 이미지

source: 图片.jpg
en: image.jpg
ja: 画像.jpg
ko: 이미지.jpg

source: 图片中未识别到二维码，请选择更清晰的原图
en: No QR code found in the image; choose a clearer original
ja: 画像から QR コードを検出できませんでした。より鮮明な元画像を選択してください
ko: 이미지에서 QR 코드를 인식하지 못했습니다. 더 선명한 원본 이미지를 선택하세요

source: 在后端核对同一个随机码后批准此设备。剩余 %lld 秒。
en: Verify the same random code on the backend, then approve this device. %lld seconds left.
ja: バックエンドで同じランダムコードを確認してから、このデバイスを承認してください。残り %lld 秒。
ko: 백엔드에서 같은 무작위 코드를 확인한 후 이 기기를 승인하세요. %lld초 남음.

source: 在新标签打开
en: Open in new tab
ja: 新しいタブで開く
ko: 새 탭에서 열기

source: 在网页中预览
en: Preview as web page
ja: Web ページとしてプレビュー
ko: 웹 페이지로 미리 보기

source: 在页面完成操作后，返回并点击“已完成，继续”。
en: After finishing on the page, come back and tap “Done, continue”.
ja: ページで操作を完了したら、戻って「完了、続行」をタップしてください。
ko: 페이지에서 작업을 마친 후 돌아와 ‘완료, 계속’을 탭하세요.

source: 基准分支
en: Base branch
ja: ベースブランチ
ko: 기준 브랜치

source: 填写该 Agent 的供应商配置 JSON 对象。
en: Enter the provider configuration JSON object for this Agent.
ja: このエージェントのプロバイダー設定 JSON オブジェクトを入力してください。
ko: 이 에이전트의 프로바이더 설정 JSON 객체를 입력하세요.

source: 处理全部 PR 问题
en: Address all PR issues
ja: PR のすべての問題に対応
ko: 모든 PR 문제 처리

source: 处理审查评论
en: Address review comments
ja: レビューコメントに対応
ko: 리뷰 댓글 처리

source: 处理待审批请求
en: Handle pending approvals
ja: 承認待ちのリクエストを処理
ko: 승인 대기 요청 처리

source: 复制
en: Copy
ja: コピー
ko: 복사

source: 复制代码
en: Copy code
ja: コードをコピー
ko: 코드 복사

source: 复制回复
en: Copy reply
ja: 返信をコピー
ko: 응답 복사

source: 复制最近一条 Agent 回复
en: Copy latest Agent reply
ja: 最新のエージェントの返信をコピー
ko: 최근 에이전트 응답 복사

source: 复制终端内容？
en: Copy terminal content?
ja: ターミナルの内容をコピーしますか？
ko: 터미널 내용을 복사하시겠습니까?

source: 外观
en: Appearance
ja: 外観
ko: 외관

source: 外部管理
en: Externally managed
ko: 외부 관리

source: 失败
en: Failed
ja: 失敗
ko: 실패

source: 好
en: OK
ja: OK
ko: 확인

source: 始终允许
en: Always allow
ja: 常に許可
ko: 항상 허용

source: 子代理
en: Subagents
ja: サブエージェント
ko: 서브 에이전트

source: 子代理与记忆
en: Subagents & memory
ja: サブエージェントとメモリ
ko: 서브 에이전트 및 메모리

source: 子代理（%lld）
en: Subagents (%lld)
ja: サブエージェント（%lld）
ko: 서브 에이전트(%lld)

source: 子代理，%lld 个运行或排队中
en: Subagents, %lld running or queued
ja: サブエージェント、%lld 件が実行中または待機中
ko: 서브 에이전트, %lld개 실행 중 또는 대기 중

source: 完全访问
en: Full access
ja: フルアクセス
ko: 전체 액세스

source: 完成
en: Done
ja: 完了
ko: 완료

source: 完整记录中仍未找到这次请求，原消息保留在待核对区
en: This request still wasn't found in the full history; the original message stays in the review area
ja: 完全な履歴にもこのリクエストが見つからないため、元のメッセージは確認待ちエリアに残しています
ko: 전체 기록에서도 이 요청을 찾지 못해 원본 메시지를 확인 대기 영역에 보관합니다

source: 官方订阅（grok login）
en: Official subscription (grok login)
ja: 公式サブスクリプション（grok login）
ko: 공식 구독(grok login)

source: 实时事件流已结束；终端输出可能缺失。重新连接后经「终端选项」核对 PTY。
en: The live event stream ended; terminal output may be missing. After reconnecting, check the PTY via “Terminal options”.
ja: リアルタイムイベントストリームが終了しました。ターミナル出力が欠落している可能性があります。再接続後、「ターミナルオプション」から PTY を確認してください。
ko: 실시간 이벤트 스트림이 종료되었습니다. 터미널 출력이 누락되었을 수 있습니다. 다시 연결한 후 ‘터미널 옵션’에서 PTY를 확인하세요.

source: 实时事件缓冲区已满，请重新同步
en: Live event buffer is full; resync
ja: リアルタイムイベントのバッファがいっぱいです。再同期してください
ko: 실시간 이벤트 버퍼가 가득 찼습니다. 다시 동기화하세요

source: 实时连接中断或丢失事件；PTY 不支持历史重放，缺失输出无法补回。
en: The live connection dropped or lost events; the PTY does not support history replay, so missing output cannot be recovered.
ja: リアルタイム接続が中断したか、イベントが失われました。PTY は履歴の再生に対応していないため、欠落した出力は復元できません。
ko: 실시간 연결이 끊기거나 이벤트가 유실되었습니다. PTY는 기록 재생을 지원하지 않으므로 누락된 출력은 복구할 수 없습니다.

source: 实际操作参数：%@
en: Actual action parameters: %@
ja: 実際の操作パラメーター：%@
ko: 실제 작업 매개변수: %@

source: 审批
en: Approval
ja: 承認
ko: 승인

source: 审批已失效，请同步当前记录
en: This approval is no longer valid; sync the current history
ja: 承認は無効になりました。現在の履歴を同期してください
ko: 승인이 더 이상 유효하지 않습니다. 현재 기록을 동기화하세요

source: 审批请求
en: Approval request
ja: 承認リクエスト
ko: 승인 요청

source: 审查：通过 %lld · 需修改 %lld · 评论 %lld
en: Reviews: %lld approved · %lld changes requested · %lld commented
ja: レビュー：承認 %lld · 要修正 %lld · コメント %lld
ko: 리뷰: 승인 %lld · 변경 요청 %lld · 댓글 %lld

source: 审阅：%@
en: Review: %@
ja: レビュー：%@
ko: 검토: %@

source: 宿主未返回关联请求 ID 或最终 Diff，无法确认异步结果
en: The host did not return a correlated request ID or final diff; the async result cannot be confirmed
ja: ホストが関連リクエスト ID または最終 Diff を返さなかったため、非同期の結果を確認できません
ko: 호스트가 연결된 요청 ID나 최종 Diff를 반환하지 않아 비동기 결과를 확인할 수 없습니다

source: 密钥显示为掩码；保持掩码不变即沿用已存密钥。
en: The key is shown masked; leave the mask unchanged to keep the stored key.
ja: キーはマスク表示されています。マスクをそのままにすると保存済みキーが維持されます。
ko: 키가 마스킹되어 표시됩니다. 마스킹을 그대로 두면 저장된 키가 유지됩니다.

source: 密钥由后端脱敏返回；保持掩码值不变即沿用已存密钥。
en: The backend returns the key redacted; leave the masked value unchanged to keep the stored key.
ja: キーはバックエンドでマスクされて返されます。マスク値をそのままにすると保存済みキーが維持されます。
ko: 키는 백엔드에서 마스킹되어 반환됩니다. 마스킹된 값을 그대로 두면 저장된 키가 유지됩니다.

source: 对话
en: Conversation
ja: 会話
ko: 대화

source: 对话不可用
en: Conversation unavailable
ja: 会話を利用できません
ko: 대화를 사용할 수 없습니다

source: 对话名称
en: Conversation name
ja: 会話名
ko: 대화 이름

source: 对话已切换，请重新打开
en: The conversation changed; reopen it
ja: 会話が切り替わりました。開き直してください
ko: 대화가 전환되었습니다. 다시 여세요

source: 对话已失效
en: Conversation is no longer available
ja: 会話は無効になりました
ko: 대화가 더 이상 유효하지 않습니다

source: 对话恢复响应不匹配
en: Conversation resume response mismatch
ja: 会話の再開応答が一致しません
ko: 대화 재개 응답이 일치하지 않습니다

source: 对话摘录
en: Conversation excerpt
ja: 会話の抜粋
ko: 대화 발췌

source: 对话菜单
en: Conversation menu
ja: 会話メニュー
ko: 대화 메뉴

source: 对话记录
en: Conversation history
ja: 会話履歴
ko: 대화 기록

source: 对话记忆
en: Conversation memory
ja: 会話メモリ
ko: 대화 메모리

source: 导入
en: Import
ja: インポート
ko: 가져오기

source: 导入后端提供的配对信息，或申请设备验证。
en: Import the pairing info provided by the backend, or request device verification.
ja: バックエンドが提供するペアリング情報をインポートするか、デバイス認証を申請してください。
ko: 백엔드가 제공한 페어링 정보를 가져오거나 기기 인증을 신청하세요.

source: 导入当前生效配置
en: Import current active config
ja: 現在有効な設定をインポート
ko: 현재 적용 중인 설정 가져오기

source: 导入配对
en: Import pairing
ja: ペアリングをインポート
ko: 페어링 가져오기

source: 导出对话
en: Export conversation
ja: 会話をエクスポート
ko: 대화 내보내기

source: 导出调试日志
en: Export debug logs
ja: デバッグログをエクスポート
ko: 디버그 로그 내보내기

source: 将二维码放在画面中；分片二维码可连续扫描。
en: Place the QR code in the frame; multi-part QR codes can be scanned one after another.
ja: QR コードを枠内に収めてください。分割 QR コードは続けてスキャンできます。
ko: QR 코드를 화면 안에 맞추세요. 분할 QR 코드는 연속으로 스캔할 수 있습니다.

source: 将从后端删除此对话及历史，无法撤销。
en: This conversation and its history will be deleted from the backend. This cannot be undone.
ja: この会話と履歴をバックエンドから削除します。元に戻せません。
ko: 이 대화와 기록이 백엔드에서 삭제됩니다. 되돌릴 수 없습니다.

source: 将升级后端“%@”（%@）上的 CLI。后端有正在运行的 Agent 时会拒绝升级。
en: This upgrades the CLI on backend “%@” (%@). The backend rejects the upgrade while an Agent is running.
ja: バックエンド「%@」（%@）の CLI をアップグレードします。実行中のエージェントがある場合、バックエンドはアップグレードを拒否します。
ko: 백엔드 ‘%@’(%@)의 CLI를 업그레이드합니다. 실행 중인 에이전트가 있으면 백엔드가 업그레이드를 거부합니다.

source: 将原样插入 %@。可在消息输入框补充参数。
en: %@ will be inserted as is. You can add arguments in the message box.
ja: %@ をそのまま挿入します。メッセージ入力欄で引数を追加できます。
ko: %@을(를) 그대로 삽입합니다. 메시지 입력란에서 인수를 추가할 수 있습니다.

source: 将同时从 live 配置中移除该节点。
en: This node will also be removed from the live config.
ja: このノードは live 設定からも削除されます。
ko: 이 노드는 live 설정에서도 제거됩니다.

source: 将把已审阅的「%@」请求发送到当前对话。Agent 将按请求执行，可能修改仓库或 PR。%@
en: The reviewed “%@” request will be sent to the current conversation. The Agent will act on it and may modify the repository or PR.%@
ja: レビュー済みの「%@」リクエストを現在の会話に送信します。エージェントはリクエストに従って実行し、リポジトリや PR を変更する可能性があります。%@
ko: 검토한 ‘%@’ 요청을 현재 대화로 보냅니다. 에이전트가 요청에 따라 실행하며 리포지토리나 PR을 변경할 수 있습니다.%@

source: 将提交“%@”。请确认这符合你的意愿。
en: “%@” will be submitted. Make sure this is what you want.
ja: 「%@」を送信します。意図どおりか確認してください。
ko: ‘%@’을(를) 제출합니다. 원하는 내용인지 확인하세요.

source: 将改写该 Agent 的全局配置文件，对 TodeX 内外的新会话同时生效；运行中的会话不受影响。
en: This rewrites the Agent's global config file and applies to new sessions both inside and outside TodeX; running sessions are not affected.
ja: このエージェントのグローバル設定ファイルを書き換え、TodeX 内外の新しいセッションに適用されます。実行中のセッションには影響しません。
ko: 이 에이전트의 전역 설정 파일을 다시 쓰며 TodeX 안팎의 새 세션에 모두 적용됩니다. 실행 중인 세션에는 영향을 주지 않습니다.

source: 将结束后端 PTY 中的进程。
en: This ends the process in the backend PTY.
ja: バックエンドの PTY 内のプロセスを終了します。
ko: 백엔드 PTY의 프로세스를 종료합니다.

source: 尚无缓存的工作区
en: No cached workspaces yet
ja: キャッシュされたワークスペースはまだありません
ko: 캐시된 워크스페이스가 아직 없습니다

source: 尚未列出工具，请先刷新
en: Tools not listed yet; refresh first
ja: ツールがまだ一覧表示されていません。先に更新してください
ko: 도구가 아직 표시되지 않았습니다. 먼저 새로고침하세요

source: 尚未初始化 Git
en: Git not initialized
ja: Git が未初期化です
ko: Git이 초기화되지 않았습니다

source: 尚未初始化 Git · %@
en: Git not initialized · %@
ja: Git が未初期化です · %@
ko: Git이 초기화되지 않았습니다 · %@

source: 尚未核对后端 PTY
en: Backend PTY not verified yet
ja: バックエンドの PTY をまだ確認していません
ko: 백엔드 PTY를 아직 확인하지 않았습니다

source: 尚未设置地址
en: No address set
ja: アドレスが未設定です
ko: 주소가 설정되지 않았습니다

source: 尚未连接
en: Not connected
ja: 未接続
ko: 연결되지 않음

source: 尚未连接后端
en: Not connected to a backend
ja: バックエンドに未接続
ko: 백엔드에 연결되지 않음

source: 尺寸同步失败：%@
en: Size sync failed: %@
ja: サイズの同期に失敗しました：%@
ko: 크기 동기화 실패: %@

source: 展开或收起后端提供的完整请求内容
en: Expand or collapse the full request content from the backend
ja: バックエンドが提供したリクエスト内容全体を展開または折りたたむ
ko: 백엔드가 제공한 전체 요청 내용 펼치기 또는 접기

source: 工作区
en: Workspace
ja: ワークスペース
ko: 워크스페이스

source: 工作区不可用
en: Workspace unavailable
ja: ワークスペースを利用できません
ko: 워크스페이스를 사용할 수 없습니다

source: 工作区信任
en: Workspace trust
ja: ワークスペースの信頼
ko: 워크스페이스 신뢰

source: 工作区共享
en: Shared per workspace
ja: ワークスペースごとに共有
ko: 워크스페이스별 공유

source: 工作区名称
en: Workspace name
ja: ワークスペース名
ko: 워크스페이스 이름

source: 工作区名称：%@ 工作区路径：%@%@ %@ PR 操作只针对%@当前分支的 PR。若无法唯一确定目标，先列出候选并询问我。核实实际能力和执行结果，不得将请求已发送视为操作完成。
en: Workspace name: %@ Workspace path: %@%@ %@ PR actions apply only to the PR for the current branch of %@. If the target cannot be uniquely determined, list the candidates and ask me first. Verify actual capabilities and results; do not treat a sent request as a completed action.
ja: ワークスペース名：%@ ワークスペースのパス：%@%@ %@ PR 操作は%@の現在のブランチの PR のみを対象とします。対象を一意に特定できない場合は、先に候補を挙げて私に確認してください。実際の機能と実行結果を検証し、リクエストの送信を操作の完了とみなさないでください。
ko: 워크스페이스 이름: %@ 워크스페이스 경로: %@%@ %@ PR 작업은 %@의 현재 브랜치 PR에만 적용합니다. 대상을 하나로 특정할 수 없으면 먼저 후보를 나열하고 저에게 물어보세요. 실제 기능과 실행 결과를 확인하고, 요청 전송을 작업 완료로 간주하지 마세요.

source: 工作区文件预览 · 已为此标签启用页面脚本；相对路径资源不会加载。
en: Workspace file preview · Page scripts enabled for this tab; relative-path resources won't load.
ja: ワークスペースのファイルプレビュー · このタブでページスクリプトを有効にしました。相対パスのリソースは読み込まれません。
ko: 워크스페이스 파일 미리 보기 · 이 탭에서 페이지 스크립트가 활성화되었습니다. 상대 경로 리소스는 로드되지 않습니다.

source: 工作区文件预览 · 页面脚本已禁用（可点按 { } 启用）；相对路径资源不会加载。
en: Workspace file preview · Page scripts disabled (tap { } to enable); relative-path resources won't load.
ja: ワークスペースのファイルプレビュー · ページスクリプトは無効です（{ } をタップで有効化）。相対パスのリソースは読み込まれません。
ko: 워크스페이스 파일 미리 보기 · 페이지 스크립트 비활성화됨({ }를 탭해 활성화). 상대 경로 리소스는 로드되지 않습니다.

source: 工作区根目录
en: Workspace root
ja: ワークスペースのルート
ko: 워크스페이스 루트

source: 工作区没有 Legacy Codex session；普通 Git 状态仍可使用。
en: The workspace has no Legacy Codex session; regular Git status is still available.
ja: ワークスペースに Legacy Codex session がありません。通常の Git の状態は引き続き利用できます。
ko: 워크스페이스에 Legacy Codex session이 없습니다. 일반 Git 상태는 계속 사용할 수 있습니다.

source: 工作区目录（文件与文件夹）
en: Workspace directory (files and folders)
ja: ワークスペースのディレクトリ（ファイルとフォルダー）
ko: 워크스페이스 디렉터리(파일 및 폴더)

source: 工作区记忆
en: Workspace memory
ja: ワークスペースメモリ
ko: 워크스페이스 메모리

source: 工作台共享方式
en: Workbench sharing
ja: ワークベンチの共有方法
ko: 워크벤치 공유 방식

source: 工作台选项
en: Workbench options
ja: ワークベンチのオプション
ko: 워크벤치 옵션

source: 工作树
en: Worktree
ja: ワークツリー
ko: 워크트리

source: 工作树干净
en: Working tree clean
ja: 作業ツリーはクリーンです
ko: 작업 트리 깨끗함

source: 工作树未能自动打开
en: Couldn't open the worktree automatically
ja: ワークツリーを自動で開けませんでした
ko: 워크트리를 자동으로 열지 못했습니다

source: 工作树未能自动打开：%@
en: Couldn't open the worktree automatically: %@
ja: ワークツリーを自動で開けませんでした：%@
ko: 워크트리를 자동으로 열지 못했습니다: %@

source: 工作树绝对路径
en: Absolute worktree path
ja: ワークツリーの絶対パス
ko: 워크트리 절대 경로

source: 工作树（%lld）
en: Worktrees (%lld)
ja: ワークツリー（%lld）
ko: 워크트리(%lld)

source: 工作模式：%@
en: Work mode: %@
ja: 作業モード：%@
ko: 작업 모드: %@
